.config/emacs/README.org
** Emacs itself

For consistency, we configure Emacs via a =use-package= statement, in
the same way we configure everything else. This is mostly about better
defaults, because the... /default/ defaults are not exactly sane.

#+begin_src emacs-lisp
;;; Configuring Emacs itself
(use-package emacs
  :ensure nil ;; Important for built-in packages.

  :init
  ;; Keep backup and save files in a dedicated directory.
  (setq backup-directory-alist
    `((".*" . ,(concat user-emacs-directory "backups")))
    auto-save-file-name-transforms
    `((".*" ,(concat user-emacs-directory "backups") t)))

  (setq create-lockfiles nil) ;; No need to create lockfiles.

  (set-charset-priority 'unicode) ;; UTF-8 everywhere.
  (setq locale-coding-system 'utf-8
        coding-system-for-read 'utf-8
        coding-system-for-write 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
  (setq default-process-coding-system '(utf-8-unix . utf-8-unix))

  :custom
  ;; Better defaults.
  (auto-save-default nil)                 ;; Don't autosave buffers.
  (backup-by-copying t)                   ;; Use copying to create backups.
  (column-number-mode t)                  ;; Display the column number in the mode line.
  (delete-by-moving-to-trash t)           ;; Move deleted files to the trash instead of permanently deleting them.
  (delete-selection-mode 1)               ;; Enable replacing selected text with typed text.
  (frame-inhibit-implied-resize t)        ;; Useless for a tiling window manager.
  (global-auto-revert-mode nil)           ;; Disable global auto-revert mode.
  (global-auto-revert-non-file-buffers 1) ;; Automatically refresh non-file buffers.
  (indent-tabs-mode nil)                  ;; No tabs.
  (ispell-dictionary "en_GB")             ;; Set the default dictionary for spell checking.
  (recentf-mode 1)                        ;; Enable tracking of recently opened files.
  (save-place-mode 1)                     ;; Enable saving the place in files for easier return.
  (savehist-mode 1)                       ;; Enable saving of command history.
  (sentence-end-double-space nil)         ;; Seriously, no one does this anymore.
  (split-width-threshold 300)             ;; Prevent window splitting if the window width exceeds 300 pixels.
  (tab-width 4)                           ;; Set the tab width to 4 spaces.
  (use-short-answers t)                   ;; Use short answers in prompts.
  (winner-mode)                           ;; Enable winner mode to easily undo window config changes.
  (xterm-mouse-mode 1)                    ;; Enable mouse support in terminal mode.

  (modify-coding-system-alist 'file "" 'utf-8)

  ;; Interface enhancements
  (blink-cursor-mode -1)                    ;; Steady cursor.
  (display-line-numbers-type 'relative)     ;; Use relative line numbering in programming modes.
  (display-line-numbers-width 3)            ;; Set a minimum for line numbers width.
  (file-name-shadow-mode 1)                 ;; Enable shadowing of filenames for clarity.
  (global-display-line-numbers-mode 1)      ;; Display line-numbers mode globally.
  (global-hl-line-mode nil)                 ;; Highlight the current line.
  (global-visual-line-mode t)               ;; Visual-Line mode in all buffers.
  (indicate-buffer-boundaries 'left)        ;; Show buffer top and bottom in the margin.
  (show-paren-mode t)                       ;; Highlight matching parens.
  (show-trailing-whitespace nil)            ;; Self-explanatory.
  (switch-to-buffer-obey-display-actions t) ;; Make switching buffers more consistent.
  (x-underline-at-descent-line nil)         ;; Prettier underlines.

  ;; Minibuffer/completion settings.
  (completion-auto-help 'always)                  ; Open completion always; `lazy' another option.
  (completion-auto-select 'second-tab)
  (completion-cycle-threshold 1)                  ; TAB cycles candidates.
  (completion-styles '(basic initials substring)) ; Different styles to match input to candidates.
  (completions-detailed t)                        ; Show annotations.
  (completions-format 'one-column)
  (completions-group t)
  (completions-max-height 20)                     ; This is arbitrary.
  (enable-recursive-minibuffers t)                ; Use the minibuffer whilst in the minibuffer.
  (tab-always-indent 'complete)                   ; When I hit TAB, try to complete, otherwise, indent.

  ;; Display a counter showing the number of the current and the other
  ;; matches.  Place it before the prompt, though it can be after it.
  (setq isearch-lazy-count t)
  (setq lazy-count-prefix-format "(%s/%s) ")
  (setq lazy-count-suffix-format nil)

  (keymap-set minibuffer-mode-map "TAB" 'minibuffer-complete) ; TAB acts more like how it does in the shell.

  :config
  ;; Make sure ] b and [ b will always load a file buffer.
  (defun skip-these-buffers (_window buffer _bury-or-kill)
    "Function for `switch-to-prev-buffer-skip'."
    (string-match "\\*[^*]+\\*" (buffer-name buffer)))
    (setq switch-to-prev-buffer-skip 'skip-these-buffers)

  ;; Custom file.
  (setq custom-file (locate-user-emacs-file "custom-vars.el")) ;; Specify the custom file path.
  (load custom-file 'noerror 'nomessage) ;; Load the custom file quietly, ignoring errors.

  ;; Vim brain.
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  ;; Hide commands in M-x which don't work in the current mode.
  (setq read-extended-command-predicate #'command-completion-default-include-p))

  ;; Disable line numbers and hl-line mode in certain contexts.
  (dolist (mode
           '(dashboard-mode-hook
             eshell-mode-hook
             markdown-mode-hook
             nov-mode-hook
             org-mode-hook
             shell-mode-hook
             term-mode-hook
             typst-ts-mode-hook))
    (add-hook mode (lambda () (hl-line-mode 0)))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Dired

Some better defaults for =dired=, courtesy of [[https://github.com/LionyxML/emacs-kick][emacs-kick]] again. [[*Dired enhancements][Dired enhancements]], [[*Dired][Dired keybindings]].

#+begin_src emacs-lisp
;;; Dired configuration
(use-package dired
  :ensure nil
  :defines dired-mode-map
  :config
  (setq dired-listing-switches "-AGFhlv --group-directories-first --time-style=long-iso"
        dired-dwim-target t
        dired-guess-shell-alist-user '((".*" "xdg-open"))
        dired-kill-when-opening-new-dired-buffer t
        dired-auto-revert-buffer #'dired-directory-changed-p
        dired-make-directory-clickable t
        dired-mouse-drag-files t)
  :init
  (add-hook 'dired-mode-hook
            (lambda ()
              (dired-hide-details-mode)
              (hl-line-mode)
              (auto-revert-mode)
              (setq-default auto-revert-interval 1)
              (auto-revert-set-timer))))
#+end_src

** Electric

Enable and configure Electric to take care of parens matching.

TODO: move org-src indent to its proper location.

#+begin_src emacs-lisp
;;; Electric
(use-package electric
  :ensure nil
  :init
  (electric-pair-mode +1) ;; automatically insert closing parens
  (electric-indent-mode -1) ;; weird and inconsistent as hell, go away
  (setq electric-pair-preserve-balance t
        ;; TODO: Why is this here?
        org-edit-src-content-indentation 0))
  ;; Do not auto-pair <> in Org mode, otherwise org-tempo can break.
  (add-hook 'org-mode-hook (lambda ()
             (setq-local electric-pair-inhibit-predicate
                     `(lambda (c)
                    (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
#+end_src

** Org

Org seems to be /massive/. We're not going to be doing much with it at
this point, because I don't quite understand what is going on there.
+Still, something tells me that having a separate top-level heading for
everything Org-related is a wise idea.+

