.config/emacs/README.org
*** Org settings

First, Org mode itself.

#+begin_src emacs-lisp
;;; Org mode
;;
(use-package org
  :ensure nil
  :defer t
  :init
  ;; Edit settings
  (setq org-auto-align-tags nil
	    org-tags-column 0
	    org-catch-invisible-edits 'show-and-error
	    org-special-ctrl-a/e t ;; special navigation behaviour in headlines
	    org-insert-heading-respect-content t

        ;; Styling, hide markup, etc.
        org-startup-indented nil
        org-pretty-entities t
        org-use-sub-superscripts "{}"
        org-hide-emphasis-markers t
        org-startup-with-inline-images t
        org-image-actual-width '(300)
        org-src-fontify-natively t
        org-highlight-latex-and-related '(native)

        ;; Agenda styling
        org-agenda-tags-column 0
	    org-agenda-block-separator ?─
	    org-agenda-time-grid
	    '((daily today require-timed)
	      (800 1000 1200 1400 1600 1800 2000)
	      " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
	    org-agenda-current-time-string
	    "⭠ now ─────────────────────────────────────────────────")

  (setq org-ellipsis " ")

  ;;; Return or left-click with mouse follows link
  (customize-set-variable 'org-return-follows-link t)
  (customize-set-variable 'org-mouse-1-follows-link t))
#+end_src

*** org-appear

Show emphasis and other markdown of text under point, otherwise keep it hidden.

#+begin_src emacs-lisp
(use-package org-appear
  :defer t
  :after org
  :config
  (setq org-appear-autoemphasis t
        org-appear-autosubmarkers t
        org-appear-autolinks t)
  :hook
  (org-mode . org-appear-mode))
#+end_src

*** org-tempo

=org-tempo= provides template expansion for Org documents. Why is it
disabled by default? Only RMS knows.

#+begin_src emacs-lisp
;; org-tempo
(use-package org-tempo
  :ensure nil
  :after org
  :config
   (dolist (item '(("sh" . "src sh")
                   ("el" . "src emacs-lisp")
                   ("lu" . "src lua")
                   ("py" . "src python")))
   (add-to-list 'org-structure-template-alist item)))
#+end_src

*** toc-org

Generate tables of contents inside Org documents.

#+begin_src emacs-lisp
;; toc-org
(use-package toc-org
  :after org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** org-modern

#+begin_src emacs-lisp
;;; org-modern
(use-package org-modern
  :defer t
  :config
  (setq org-modern-fold-stars '(("󰬪" . "󰬦")
                                ("󰬫" . "󰬧")
                                ("󰅂" . "󰅀")
                                ("󰄾" . "󰄼")
                                ("󰶻" . "󰶹")))
  :custom
  (org-modern-hide-stars 'leading)
  (org-modern-keyword t)
  (org-modern-checkbox nil)
  (org-modern-table nil)
  (org-modern-star 'fold)

  :hook
  (org-mode . global-org-modern-mode))
#+end_src

*** org-tree-slide

Simple slideshow functionality for Org documents based on headings.

#+begin_src emacs-lisp
;; org-tree-slide
(use-package org-tree-slide
  :defer t)
#+end_src

*** TODO ox-typst

Org mode to Typst exporter, very early in development. [[https://github.com/jmpunkt/ox-typst][jmpunkt/ox-typst]]

#+begin_src emacs-lisp :tangle no
;; ox-typst
(use-package ox-typst
  :defer t
  :after org
  :ensure (ox-typst :host github :repo "jmpunkt/ox-typst"))
#+end_src

** Project.el

#+begin_src emacs-lisp
(use-package project
  :ensure nil
  :defer t)
#+end_src

** Window management

Some window management tweaks (no, not that kind), based on [[https://github.com/LionyxML/emacs-kick][emacs-kick]].

#+begin_src emacs-lisp
;;; Emacs window management
(use-package window
  :ensure nil
  :custom
  (display-buffer-alist
   '(
	 ;; ("\\*.*e?shell\\*"
     ;;  (display-buffer-in-side-window)
     ;;  (window-height . 0.25)
     ;;  (side . bottom)
     ;;  (slot . -1))

     ("\\*\\(Backtrace\\|Warnings\\|Compile-Log\\|[Hh]elp\\|Messages\\|Bookmark List\\|Ibuffer\\|Occur\\|eldoc.*\\)\\*"
      (display-buffer-in-side-window)
      (window-height . 0.25)
      (side . bottom)
      (slot . 0))

     ;; Example configuration for the LSP help buffer,
     ;; keeps it always on bottom using 25% of the available space:
     ("\\*\\(lsp-help\\)\\*"
      (display-buffer-in-side-window)
      (window-height . 0.25)
      (side . bottom)
      (slot . 0))

     ;; Configuration for displaying various diagnostic buffers on
     ;; bottom 25%:
     ("\\*\\(Flymake diagnostics\\|Flycheck error messages\\||xref\\|ivy\\|Swiper\\|Completions\\)"
      (display-buffer-in-side-window)
      (window-height . 0.25)
      (side . bottom)
      (slot . 1))
   )))
#+end_src

* Third-party packages
:PROPERTIES:
:header-args: :tangle init.el
:END:

Don't overdo it, though.

#+begin_src emacs-lisp
;;; Third-party packages
#+end_src

** Appearance

We want a minimal Emacs, but we also want a nice-looking Emacs.

*** Fonts

Define the default fonts we want Emacs to use, as well as some more comfortable line spacing.

#+begin_src emacs-lisp
;;; Fonts
;;
;; Define default, variable pitch, and fixed pitch fonts.
(set-face-attribute 'default nil
  :family "monospace"
  :height 100)
(set-face-attribute 'variable-pitch nil
  :family "ETbb"
  :height 1.5
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :family "monospace"
  :height 1.0)

;; Display commented text and keywords in italics, requires a font with italics support.
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)

;; Adjust line spacing.
(setq-default line-spacing 0.35)

;; Org mode title heights
(custom-set-faces
  '(org-document-title ((t (:inherit default :height 1.4))))
  '(org-level-1 ((t (:inherit outline-1 :height 1.4))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.3))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.2))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.1))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.0)))))
#+end_src

*** Nerd Icons

We cannot have a modern editor without Nerd Icons, can we? Yes, we can, but we won't.

#+begin_src emacs-lisp
;;; Icons
;;
;; nerd-icons
(use-package nerd-icons
  :defer t)

;; nerd-icons-dired
(use-package nerd-icons-dired
  :defer t
  :hook
  (dired-mode . nerd-icons-dired-mode))

;; nerd-icons-completion
(use-package nerd-icons-completion
  :after (:all nerd-icons marginalia)
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))
#+end_src

*** Theme and modeline

It's Tokyo Night with custom colours, what else would it be?

#+begin_src emacs-lisp
;;; Theme
;;
;; Add local themes to path
(add-to-list 'custom-theme-load-path (concat user-emacs-directory "themes"))

;; doom-themes
(use-package doom-themes
  :config
  ;; Global settings
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t)
  ;; doom-themes tweaks
  (doom-themes-visual-bell-config)
  (doom-themes-org-config)

  ;; Load a theme
  (load-theme 'doom-gatonegro t))

;; doom-modeline
;; NOTE: Install `extra/ttf-nerd-fonts-symbols-mono', otherwise icon spacing is broken
(use-package doom-modeline
  :defer t
  :config
  (setq doom-modeline-icon t        ; enable icons
        doom-modeline-bar-width 5   ; set the bar width
        doom-modeline-height 35     ; set modeline height
        doom-modeline-persp-icon t  ; add perspective name to modeline
        doom-modeline-persp-name t) ; add folder icon next to persp name
  :hook
  (elpaca-after-init . doom-modeline-mode))
#+end_src

*** Dashboard

Entirely unnecessary, but it looks good.

#+begin_src emacs-lisp
;; dashboard
(use-package dashboard
  :defer t
  :init
  (setq initial-buffer-choice 'dashboard-open
        dashboard-path-style 'truncate-middle
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-icon-type 'nerd-icons
        dashboard-banner-logo-title "«Objects such as corpses, painful to view in themselves, can become delightful to contemplate.»"
        ;;dashboard-startup-banner 'logo ;; use standard emacs logo as banner
        dashboard-startup-banner (concat user-emacs-directory "themes/gatonegro.png")
        dashboard-projects-backend 'project-el
        dashboard-center-content t ;; set to 't' for centered content
        dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 3)
                          (projects . 3)
                          (registers . 3)))
  :config
  (dashboard-setup-startup-hook))
#+end_src

*** Spacious-padding

The lack of padding around the buffers is 1) baffling; and 2) rather annoying. This here is a bit of a hack, from what I can gather, but it is better than having text running into the edge of the frame.

#+begin_src emacs-lisp
(use-package spacious-padding
  :disabled t
  :defer t
  :config
    (setq spacious-padding-widths
      '( :internal-border-width 20
         :header-line-width 4
         :mode-line-width 0
         :tab-width 4
         :right-divider-width 15
         :scroll-bar-width 4))
  :hook
   (elpaca-after-init . spacious-padding-mode))
#+end_src

** Completions framework

This selection comes from [[https://github.com/LionyxML/emacs-kick][emacs-kick]], though it seems to be fairly
common in newer configurations. To be honest, though, simply turning
on =ido-mode= sounds tempting.

