.config/emacs/README.org
*** Vertico

#+begin_src emacs-lisp
;;; Completions framework
;;
;; Vertico
(use-package vertico
  :defer t
  :custom
  (vertico-count 10)                    ;; Number of candidates to display in the completion list.
  (vertico-resize nil)                  ;; Disable resizing of the vertico minibuffer.
  (vertico-cycle nil)                   ;; Do not cycle through candidates when reaching the end of the list.
  :config
  ;; Navigate Vertico with C-j and C-k.
  (define-key vertico-map (kbd "C-j") #'vertico-next)
  (define-key vertico-map (kbd "C-k") #'vertico-previous)
  ;; Customize the display of the current candidate in the completion list.
  ;; This will prefix the current candidate with “» ” to make it stand out.
  ;; Reference: https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow
  (advice-add #'vertico--format-candidate :around
    (lambda (orig cand prefix suffix index _start)
      (setq cand (funcall orig cand prefix suffix index _start))
      (concat
        (if (= vertico--index index)
          (propertize "» " 'face '(:foreground "#80adf0" :weight bold))
          "  ")
        cand)))
  :hook
   (elpaca-after-init . vertico-mode))
#+end_src

*** Orderless

#+begin_src emacs-lisp
;; Orderless
(use-package orderless
  :defer t                                    ;; Load Orderless on demand.
  :after vertico                              ;; Ensure Vertico is loaded before Orderless.
  :init
  (setq completion-styles '(orderless basic)  ;; Set the completion styles.
        completion-category-defaults nil      ;; Clear default category settings.
        completion-category-overrides '((file (styles partial-completion))))) ;; Customize file completion styles.
#+end_src

*** Marginalia

#+begin_src emacs-lisp
;; Marginalia
(use-package marginalia
  :defer t
  :hook
  (elpaca-after-init . marginalia-mode))
#+end_src

*** Company

#+begin_src emacs-lisp
;; Company
(use-package company
  :defer t
  :custom
  (company-tooltip-align-annotations t)      ;; Align annotations with completions.
  (company-minimum-prefix-length 1)          ;; Trigger completion after typing 1 character
  (company-idle-delay 0.2)                   ;; Delay before showing completion (adjust as needed)
  (company-tooltip-maximum-width 50)
  :config

  ;; While using C-p C-n to select a completion candidate
  ;; C-y quickly shows help docs for the current candidate
  (define-key company-active-map (kbd "C-y")
			  (lambda ()
				(interactive)
				(company-show-doc-buffer)))
  (define-key company-active-map [tab] 'company-complete-selection)
  (define-key company-active-map [ret] 'company-complete-selection)
  (define-key company-active-map [escape] 'company-abort)
  (define-key company-active-map (kbd "RET") 'company-complete-selection)
  (define-key company-active-map (kbd "C-j") 'company-select-next)
  (define-key company-active-map (kbd "C-k") 'company-select-previous)
  :hook
  (elpaca-after-init . global-company-mode)) ;; Enable Company Mode globally after initialization.
#+end_src

*** Consult

Better search and navigation commands. [[*Consult][Consult keybindings]].

#+begin_src emacs-lisp
;; Consult
(use-package consult
  :defer t
  :init
  ;; Enhance register preview with thin lines and no mode line.
  (advice-add #'register-preview :override #'consult-register-window)

  ;; Use Consult for xref locations with a preview feature.
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref))
#+end_src

*** Embark

#+begin_src emacs-lisp
;; Embark
(use-package embark
  :defer t)
#+end_src

*** Embark-Consult

#+begin_src emacs-lisp
;; Embark-Consult
(use-package embark-consult
  :after (:all consult embark)
  :hook
  (embark-collect-mode . consult-preview-at-point-mode)) ;; Enable preview in Embark collect mode.
#+end_src

** Dired enhancements

Nothing crazy here, just some extensions and quality-of-life improvements for =dired=.

#+begin_src emacs-lisp
;;; Dired enhancements
;;
;; * dired-+
(use-package dired-x
  :ensure nil
  :after dired)

;; * dired-open
(use-package dired-open
  :after dired
  :config
  (setq dired-open-extensions '(("gif" . "xdg-open")
                                ("jpg" . "xdg-open")
                                ("png" . "xdg-open")
                                ("mkv" . "xdg-open")
                                ("m4v" . "xdg-open")
                                ("mp4" . "xdg-open"))))

;; * dired-preview
(use-package dired-preview
  :after dired
  :config
     (setq dired-preview-delay 0.7)
     (setq dired-preview-max-size (expt 2 20))
     (setq dired-preview-ignored-extensions-regexp
             (concat "\\."
                     "\\(gz\\|"
                     "zst\\|"
                     "tar\\|"
                     "xz\\|"
                     "rar\\|"
                     "zip\\|"
                     "iso\\|"
                     "epub"
                     "\\)")))
#+end_src

** Evil mode

For my own sanity, get some Vim motions going here.

#+begin_src emacs-lisp
;; Evil - Vim motions
(use-package evil
  :defer t
  :init
  (setq evil-want-integration t
        evil-want-keybinding nil
        evil-vsplit-window-right t
        evil-split-window-below t
        evil-respect-visual-line-mode t
        evil-want-Y-yank-to-eol t
        evil-undo-system 'undo-tree)

  ;; Unbind SPC and TAB so we can use them elsewhere.
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "TAB") nil))

  :config
  (evil-set-initial-state 'vterm-mode 'emacs)

  :hook
  (elpaca-after-init . evil-mode))
#+end_src

*** Evil collection

Provides =evil= support for a bunch of different modes.

#+begin_src emacs-lisp
;; Evil-Collection
(use-package evil-collection
  :defer t

  :custom
  (evil-collection-want-find-usages-bindings t)

  :hook
  (evil-mode . evil-collection-init))
#+end_src

** General - Keybindings

There is no denying that the default Emacs keybindings are... /sub-optimal/, if you will; even with my [[https://github.com/rvaiya/keyd][CapsLock key mapped to Control]], I find them quite uncomfortable after a while. So, we're going to make some changes.

*** Install =general.el= and set =leader-keys=

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup) ;; integrate general with evil

  ;; set up 'SPC' as the global leader key
  (general-create-definer gato/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode

  ;; set up ',' as the local leader key
  (general-create-definer gato/local-leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "," ;; set local leader
    :global-prefix "M-,") ;; access local leader in insert mode
#+end_src

*** Buffers

#+begin_src emacs-lisp
  ;; Buffers
  (gato/leader-keys
    "b" '(:ignore t :wk "Buffer")
    "b b" '(switch-to-buffer :wk "Switch buffer")
    "b i" '(ibuffer :wk "Ibuffer")
    "b k" '(kill-this-buffer :wk "Kill current buffer")
    "b n" '(next-buffer :wk "Next buffer")
    "b p" '(previous-buffer :wk "Previous buffer")
    "b r" '(revert-buffer :wk "Revert buffer"))
#+end_src

*** Consult

#+begin_src emacs-lisp
  ;; Consult
  (gato/leader-keys
    "c" '(:ignore t :wk "Consult")
    "c f" '(consult-fd :wk "Find files with 'fd' in DIR")
    "c g" '(consult-grep :wk "Find files with 'grep' in DIR")
    "c h" '(consult-outline :wk "Jump to outline heading")
    "c l" '(consult-line :wk "Find matching line")
    "c o" '(consult-org-heading :wk "Jump to Org heading"))
#+end_src

*** Diff-hl

#+begin_src emacs-lisp
  (general-define-key
    :states 'normal
    "] c" '(diff-hl-next-hunk :wk "Next diff hunk")
    "[ c" '(diff-hl-previous-hunk :wk "Previous diff hunk"))
#+end_src

