.config/emacs/README.org
*** Dired

#+begin_src emacs-lisp
  ;; Dired
  (gato/leader-keys
    "d" '(:ignore t :wk "Dired")
    "d d" '(dired :wk "Open Dired")
    "d j" '(dired-jump :wk "Dired jump to current")
    "d w" '(:ignore t :wk "Writable Dired")
    "d w w" '(wdired-change-to-wdired-mode :wk "Enable writable Dired")
    "d w a" '(wdired-abort-changes :wk "Abort writable Dired changes")
    "d w f" '(wdired-finish-edit :wk "Finish writable Dired edit"))

  (general-define-key
    :states 'normal
    :keymaps 'dired-mode-map
    "C-c o" 'dired-open-xdg
    "M-RET" 'dired-display-file
    "h" 'dired-up-directory
    "l" 'dired-open-file
    "m" 'dired-mark
    "t" 'dired-toggle-marks
    "u" 'dired-unmark
    "o" 'dired-open-xdg
    "p" 'dired-preview-mode
    "v" 'dired-view-file
    "C" 'dired-do-copy
    "D" 'dired-do-delete
    "J" 'dired-goto-file
    "M" 'dired-do-chmod
    "O" 'dired-do-chown
    "P" 'dired-do-print
    "R" 'dired-do-rename
    "T" 'dired-do-touch
    "Z" 'dired-do-compress
    "+" 'dired-create-directory
    "-" 'dired-up-directory
    "% l" 'dired-downcase
    "% m" 'dired-mark-files-regexp
    "% u" 'dired-upcase
    "* %" 'dired-mark-files-regexp
    "* ." 'dired-mark-extension
    "* /" 'dired-mark-directories)
#+end_src

*** Evaluate Elisp

#+begin_src emacs-lisp
;; Evaluate Elisp
(gato/leader-keys
  "e" '(:ignore t :wk "Evaluate")
  ;; Evaluate
  "e b" '(eval-buffer :wk "Evaluate Elisp in buffer")
  "e d" '(eval-defun :wk "Evaluate defun containing or after point")
  "e e" '(eval-expression :wk "Evaluate Elisp expression")
  "e l" '(eval-last-sexp :wk "Evaluate Elisp expression before point")
  "e r" '(eval-region :wk "Evaluate Elisp in region"))
#+end_src

*** Extended command (=M-x=)

#+begin_src emacs-lisp
  ;; Extended command
  (gato/leader-keys
    "SPC" '(execute-extended-command :wk "Execute extended command"))
#+end_src

*** Find files

#+begin_src emacs-lisp
;; Find files
  (gato/leader-keys
    "." '(find-file :wk "Find file")
    "f" '(:ignore t :wk "Find")
    "f c" '((lambda () (interactive) (find-file "~/.config/emacs/README.org")) :wk "Emacs configuration")
    "f r" '(recentf :wk "Recent files")
    "f u" '(sudo-edit-find-file :wk "Sudo find file")
    "f U" '(sudo-edit :wk "Sudo edit this file"))
#+end_src

*** Help

#+begin_src emacs-lisp
  ;; Help functions
  (gato/leader-keys
   "h" '(:ignore t :wk "Help")
   "h f" '(apropos-command :wk "Apropos command")
   "h f" '(describe-function :wk "Describe function")
   "h k" '(describe-key :wk "Describe key")
   "h m" '(describe-mode :wk "Describe mode")
   "h v" '(describe-variable :wk "Describe variable")
   "h x" '(describe-command :wk "Describe command")
   "h t" '(consult-theme :wk "Consult-theme")
   "h r" '((lambda () (interactive) (load-file user-init-file)) :wk "Reload Emacs config"))
#+end_src

*** Magit

#+begin_src emacs-lisp
;; Magit
(gato/leader-keys
 "g" '(:ignore t :wk "Magit")
 "g s" '(magit-status :wk "Status"))
#+end_src

*** Nov.el

#+begin_src emacs-lisp
  (general-define-key
    :states 'normal
    :keymaps 'nov-mode-map
    "J" 'nov-scroll-up
    "K" 'nov-scroll-down
    "t" 'nov-goto-toc
    "H" 'nov-previous-document
    "L" 'nov-next-document)
#+end_src

*** pdf-tools

#+begin_src emacs-lisp
(general-define-key
  :states 'normal
  :keymaps 'pdf-view-mode-map
  "j" 'pdf-view-next-line-or-next-page
  "k" 'pdf-view-previous-line-or-previous-page
  "r" 'pdf-view-themed-minor-mode
  "g g" 'pdf-view-first-page
  "G" 'pdf-view-last-page
  "g p" 'pdf-view-goto-page
  "=" 'pdf-view-enlarge
  "-" 'pdf-view-shrink)
#+end_src

*** Toggles

#+begin_src emacs-lisp
;; Toggle
  (gato/leader-keys
    "t" '(:ignore t :wk "Toggle")
    "t h" '(hl-line-mode :wk "Line highlight")
    "t l" '(display-line-numbers-mode :wk "Line numbers")
    "t o" '(olivetti-mode :wk "Olivetti")
    "t t" '(visual-line-mode :wk "Truncated lines"))
    ;; "t v" '(vterm-toggle :wk "Vterm"))

  ;; Toggle comments in normal and visual mode.
  (general-define-key
    :states '(normal)
    "g c c" '((lambda () (interactive)
        (comment-or-uncomment-region
          (line-beginning-position) (line-end-position)))
          :wk "Toggle comment"))

  (general-define-key
    :states '(visual)
    "g c" '(comment-or-uncomment-region :wk "Toggle comment"))
#+end_src

*** Typst

Compile, watch, and preview compiled =typst= documents.

#+begin_src emacs-lisp
  (gato/leader-keys
    :keymaps 'typst-ts-mode-map
    "p" '(:ignore t :wk "Typst")
    "p c" '(typst-ts-compile :wk "Compile")
    "p w" '(typst-ts-watch-mode :wk "Watch")
    "p o" '(typst-ts-mode-preview :wk "Open compiled document")
    "p p" '(typst-ts-compile-and-preview :wk "Compile and preview"))
#+end_src

*** Window manipulation

#+begin_src emacs-lisp
  ;; Windows
  (gato/leader-keys
    "w" '(:ignore t :wk "Windows")
    ;; Window splits
    "w c" '(evil-window-delete :wk "Close window")
    "w n" '(evil-window-new :wk "New window")
    "w s" '(evil-window-split :wk "Horizontal split")
    "w v" '(evil-window-vsplit :wk "Vertical split")
    ;; Window motions
    "w h" '(evil-window-left :wk "Window left")
    "w j" '(evil-window-down :wk "Window down")
    "w k" '(evil-window-up :wk "Window up")
    "w l" '(evil-window-right :wk "Window right")
    "w w" '(evil-window-next :wk "Goto next window"))
    ;; Move windows
    ;;"w H" '(buf-move-left :wk "Buffer move left")
    ;;"w J" '(buf-move-down :wk "Buffer move down")
    ;;"w K" '(buf-move-up :wk "Buffer move up")
    ;;"w L" '(buf-move-right :wk "Buffer move right"))
#+end_src

*** End of keybindings

#+begin_src emacs-lisp
) ;; end of general.el keybindings
#+end_src

** Tools

Here we have a section for random small tools, that do not merit their own separate category.

*** Diff-hl

=diff-hl= highlights uncommitted changes in a buffer. [[*Diff-hl][Diff-hl keybindings]].

#+begin_src emacs-lisp
;; Diff-hl
(use-package diff-hl
  :defer t
  :hook
  (find-file . (lambda ()
               (global-diff-hl-mode)   ;; Enable Diff-HL mode for all files.
               (diff-hl-flydiff-mode)  ;; Automatically refresh diffs.
               (diff-hl-margin-mode))) ;; Show diff indicators in the margin.
  :custom
  (diff-hl-side 'left)                           ;; Set the side for diff indicators.
  (diff-hl-margin-symbols-alist '((insert . "│") ;; Customize symbols for each change type.
                                  (delete . "-")
                                  (change . "│")
                                  (unknown . "?")
                                  (ignored . "i"))))
#+end_src

*** Jinx

A fast JIT spell-checker for Emacs.

#+begin_src emacs-lisp
(use-package jinx
  :defer t
  :bind (("M-$" . jinx-correct)
         ("C-M-$" . jinx-languages))
  :config
  (setq jinx-languages "en_GB es fr it")
  :hook
  (elpaca-after-init . global-jinx-mode))
#+end_src

*** Magit

The Emacs git client. [[*Magit][Magit keybindings]].

#+begin_src emacs-lisp
;; Transient - Install updated version needed by Magit
(use-package transient
  :defer t)

;; Magit - Git client for Emacs
(use-package magit
  :after transient
  :defer t)
#+end_src

*** Nov.el

Major mode for reading EPUB documents. [[*Nov.el][Nov.el keybindings]].

#+begin_src emacs-lisp
(use-package nov
  :defer t

  :init
  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode))

  :config
  (setq nov-text-width t)
  (add-hook 'nov-mode-hook 'olivetti-mode))
#+end_src

*** Olivetti

A distraction-free writing environment. [[*Toggles][Olivetti keybindings]].

#+begin_src emacs-lisp
(use-package olivetti
  :defer t

  :config
  (setq olivetti-body-width 82))
#+end_src

*** pdf-tools

=pdf-tools= improves support of PDF files in Emacs using =poppler= instead of the native ~ghostscript~-based built-in DocView mode. It adds annotations, as well. [[*pdf-tools][pdf-tools keybindings]].

There is one problem, however — =pdf-tools= still lacks some basic stuff, like continuous page scrolling. The author/maintainer does not seem to be spending much time on it lately, and a [[https://github.com/vedang/pdf-tools/pull/224][PR adding "pdf roll"]] has been sitting on the GitHub repo, collecting dust, for over a year. I definitely want this feature, so we're installing the "pdf-roll" branch from this fork, instead of the regular release of =pdf-tools=. If/when the PR is merged and the official package updated, we will switch back to the official version.

#+begin_src emacs-lisp
(use-package pdf-tools
  :defer t
  :ensure (:type git :host github :repo "aikrahguzar/pdf-tools"
                 :branch "upstream-pdf-roll")
  :commands (pdf-loader-installer)
  :mode "\\.pdf\\'"
  :init (pdf-loader-install)
  :config
    (add-to-list 'revert-without-query ".pdf")
     )

(add-hook 'pdf-view-mode-hook #'(lambda () (interactive) (display-line-numbers-mode -1)
                                                         (pdf-view-themed-minor-mode t)
                                                         (pdf-view-roll-minor-mode)))
#+end_src

*** Rainbow delimiters

Colour-coded delimiters based on nesting depth.

#+begin_src emacs-lisp
;; Rainbow delimiters
(use-package rainbow-delimiters
  :defer t
  :ensure t
  :hook org-mode prog-mode)
#+end_src

