.config/emacs/README.org
*** Rainbowm mode

Colorise colour names and codes in buffers.

#+begin_src emacs-lisp
;; Rainbow mode
(use-package rainbow-mode
  :defer t
  :diminish
  :hook org-mode prog-mode)
#+end_src

*** Sudo-Edit

Edit files with =sudo= privileges. [[*Find files][Sudo-edit keybindings]]

#+begin_src emacs-lisp
;; Sudo-edit
(use-package sudo-edit
  :defer t)
#+end_src

*** Undo-tree

Don't particularly care about the tree, but persistent undo history is nice.

#+begin_src emacs-lisp
(use-package undo-tree
  :defer t
  :hook
  (elpaca-after-init . global-undo-tree-mode)
  :init
  (setq undo-tree-visualizer-timestamps t
        undo-tree-visualizer-diff t
        ;; Increase undo limits to avoid losing history due to Emacs' garbage collection.
        undo-limit 800000                     ;; Limit for undo entries.
        undo-strong-limit 12000000            ;; Strong limit for undo entries.
        undo-outer-limit 120000000)           ;; Outer limit for undo entries.
  :config
  (setq undo-tree-history-directory-alist '(("." . "~/.config/emacs/.cache/undo"))))
#+end_src

** Which-Key

=which-key= is an essetial tool for discoverability. So much so that it is probably going to be a built-in functionality in Emacs 30. For now, we install it as a regular package.

#+begin_src emacs-lisp
;; Which-Key - So many keys
(use-package which-key
  :defer t

  :config
  (setq which-key-side-window-location 'bottom
        which-key-sort-order #'which-key-key-order-alpha
        which-key-sort-uppercase-first nil
        which-key-add-column-padding 1
        which-key-max-display-columns nil
        which-key-min-display-lines 6
        which-key-side-window-slot -10
        which-key-side-window-max-height 0.25
        which-key-idle-delay 0.5
        which-key-max-description-length nil
        which-key-allow-imprecise-window-fit nil
        which-key-separator "  ")

  :hook
  (elpaca-after-init . which-key-mode))
#+end_src

* LSP
:PROPERTIES:
:header-args: :tangle init.el
:END:

** Flycheck

#+begin_src emacs-lisp
;; Flycheck
(use-package flycheck
  :defer t
  :init (global-flycheck-mode))
#+end_src

** Treesit-auto

#+begin_src emacs-lisp
;; Treesit-auto
(use-package treesit-auto
  :after emacs
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode t))
#+end_src

** LSP-mode

#+begin_src emacs-lisp
;;; LSP-mode
(use-package lsp-mode
  :defer t
  :hook (
         (bash-ts-mode . lsp)  ;; Bash
         (lua-mode . lsp)      ;; Lua
         (python-mode . lsp)   ;; Python
         (typst-ts-mode . lsp) ;; Typst
         (lsp-mode . lsp-enable-which-key-integration)) ;; Integrate with Which Key
  :commands lsp
  :custom
  (lsp-keymap-prefix "C-c l")                           ;; Set the prefix for LSP commands.
  (lsp-inlay-hint-enable t)                             ;; Enable inlay hints.
  (lsp-completion-provider :none)                       ;; Disable the default completion provider.
  (lsp-session-file (locate-user-emacs-file ".lsp-session")) ;; Specify session file location.
  (lsp-log-io nil)                                      ;; Disable IO logging for speed.
  (lsp-idle-delay 0)                                    ;; Set the delay for LSP to 0 (debouncing).
  (lsp-keep-workspace-alive nil)                        ;; Disable keeping the workspace alive.
  ;; Core settings
  (lsp-enable-xref t)                                   ;; Enable cross-references.
  (lsp-auto-configure t)                                ;; Automatically configure LSP.
  (lsp-enable-links nil)                                ;; Disable links.
  (lsp-eldoc-enable-hover t)                            ;; Enable ElDoc hover.
  (lsp-enable-file-watchers nil)                        ;; Disable file watchers.
  (lsp-enable-folding nil)                              ;; Disable folding.
  (lsp-enable-imenu t)                                  ;; Enable Imenu support.
  (lsp-enable-indentation nil)                          ;; Disable indentation.
  (lsp-enable-on-type-formatting nil)                   ;; Disable on-type formatting.
  (lsp-enable-suggest-server-download t)                ;; Enable server download suggestion.
  (lsp-enable-symbol-highlighting t)                    ;; Enable symbol highlighting.
  (lsp-enable-text-document-color nil)                  ;; Disable text document color.
  ;; Modeline settings
  (lsp-modeline-code-actions-enable nil)                ;; Keep modeline clean.
  (lsp-modeline-diagnostics-enable nil)                 ;; Use `flycheck' instead.
  (lsp-modeline-workspace-status-enable t)              ;; Display "LSP" in the modeline when enabled.
  (lsp-signature-doc-lines 1)                           ;; Limit echo area to one line.
  (lsp-eldoc-render-all nil)                            ;; Render all ElDoc messages.
  ;; Completion settings
  (lsp-completion-enable t)                             ;; Enable completion.
  (lsp-completion-enable-additional-text-edit t)        ;; Enable additional text edits for completions.
  (lsp-enable-snippet nil)                              ;; Disable snippets
  (lsp-completion-show-kind t)                          ;; Show kind in completions.
  ;; Headerline settings
  (lsp-headerline-breadcrumb-enable nil)                ;; Enable symbol numbers in the headerline.
  (lsp-headerline-breadcrumb-enable-symbol-numbers nil) ;; Enable symbol numbers in the headerline.
  (lsp-headerline-arrow "▶")                            ;; Set arrow for headerline.
  (lsp-headerline-breadcrumb-enable-diagnostics nil)    ;; Disable diagnostics in headerline.
  (lsp-headerline-breadcrumb-icons-enable nil)          ;; Disable icons in breadcrumb.
  ;; Semantic settings
  (lsp-semantic-tokens-enable nil))                     ;; Disable semantic tokens.
#+end_src

* Language support
:PROPERTIES:
:header-args: :tangle init.el
:END:

** Markdown

#+begin_src emacs-lisp
;; Markdown
(use-package markdown-mode
  :defer t
  :config
  (defvar nb/current-line '(0 . 0)
    "(start . end) of current line in current buffer")
  (make-variable-buffer-local 'nb/current-line)

  (defun nb/unhide-current-line (limit)
    "Font-lock function"
    (let ((start (max (point) (car nb/current-line)))
          (end (min limit (cdr nb/current-line))))
      (when (< start end)
        (remove-text-properties start end
                                '(invisible t display "" composition ""))
        (goto-char limit)
        t)))

  (defun nb/refontify-on-linemove ()
    "Post-command-hook"
    (let* ((start (line-beginning-position))
           (end (line-beginning-position 2))
           (needs-update (not (equal start (car nb/current-line)))))
      (setq nb/current-line (cons start end))
      (when needs-update
        (font-lock-fontify-block 3))))

  (defun nb/markdown-unhighlight ()
    "Enable markdown concealling"
    (interactive)
    (markdown-toggle-markup-hiding 'toggle)
    (font-lock-add-keywords nil '((nb/unhide-current-line)) t)
    (add-hook 'post-command-hook #'nb/refontify-on-linemove nil t))
  :custom-face
  (markdown-header-delimiter-face ((t (:height 0.9))))
  (markdown-header-face-1 ((t (:height 1.6  :weight extra-bold :inherit markdown-header-face))))
  (markdown-header-face-2 ((t (:height 1.4  :weight extra-bold :inherit markdown-header-face))))
  (markdown-header-face-3 ((t (:height 1.2  :weight extra-bold :inherit markdown-header-face))))
  (markdown-header-face-4 ((t (:height 1.15 :weight bold :inherit markdown-header-face))))
  (markdown-header-face-5 ((t (:height 1.1  :weight bold :inherit markdown-header-face))))
  (markdown-header-face-6 ((t (:height 1.05 :weight semi-bold :inherit markdown-header-face))))
  :hook
  (markdown-mode . abbrev-mode)
  (markdown-mode . variable-pitch-mode)
  (markdown-mode . nb/markdown-unhighlight))
#+end_src

** Lua

#+begin_src emacs-lisp
;; Lua
(use-package lua-mode
  :defer t)
#+end_src

** Typst

Add full support for =typst=, including syntax highlighting and lsp functionality. [[*Typst][Typst keybindings]].

Requires:

- ~typst-ts-mode~: typst treesitter major mode
  https://codeberg.org/meow_king/typst-ts-mode/

- ~tinymist~: language service for typst (binary should be in `'$PATH')
  https://github.com/Myriad-Dreamin/tinymist

Support enabled by following this:

- ~lsp-mode~: adding a new language
   https://emacs-lsp.github.io/lsp-mode/page/adding-new-language/

#+begin_src emacs-lisp
;; Typst support
(use-package typst-ts-mode
  :defer t
  :ensure (:type git :host codeberg :repo "meow_king/typst-ts-mode"
                 :files (:defaults "*.el"))
  :custom
  (typst-ts-watch-options "--open")
  (typst-ts-mode-grammar-location (expand-file-name "tree-sitter/libtree-sitter-typst.so" user-emacs-directory))
  (typst-ts-mode-enable-raw-blocks-highlight t)

  ;; Register `tinymist' as the Typst language server
  :config
  (with-eval-after-load 'lsp-mode
    (add-to-list 'lsp-language-id-configuration
                 '(typst-ts-mode . "typst"))

    (lsp-register-client
     (make-lsp-client :new-connection (lsp-stdio-connection "tinymist")
                      :activation-fn (lsp-activate-on "typst")
                      :server-id 'tinymist))))
#+end_src

** =init.el= footer

#+begin_src emacs-lisp
(provide 'init)

;;; init.el ends here
#+end_src
